IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-NAME PIC X(10) VALUE 'WORLD'.

PROCEDURE DIVISION.
    DISPLAY "HELLO".
    CALL "PAYDB".
    PERFORM MAIN-LOGIC.
    STOP RUN.

MAIN-LOGIC.
    DISPLAY WS-NAME.
    EXIT.
